Revit 2027 API
BuiltInFailures.MassFailures.BooleanUnionFailed Property
 Failed to merge overlapping solids
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BooleanUnionFailed { get; }
Public Shared ReadOnly Property BooleanUnionFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BooleanUnionFailed {
	FailureDefinitionId^ get ();
}
static member BooleanUnionFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace